app/controllers/teachers_controller.rb

  def index
    @teachers = Teacher.all
---
SELECT "teachers".* FROM "teachers"

  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save
---
INSERT INTO "teachers" ("created_at", "identity", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-15 14:40:04.308906"], ["identity", "1013"], ["name", "Josh"], ["updated_at", "2014-07-15 14:40:04.308906"]]

  def destroy
    @teacher.destroy
---
DELETE FROM "teachers" WHERE "teachers"."id" = ?  [["id", 2]]

    def set_teacher
      @teacher = Teacher.find(params[:id])
---
SELECT  "teachers".* FROM "teachers"  WHERE "teachers"."id" = ? LIMIT 1  [["id", 980190962]]